/*task1
    Напишите функцию, которая будет принимать 2 числа в качесте аргументов и возвращать результат их сравнения.
    Если числа равны - функция должна вернуть true
    Если не равны - false.
    P.S. Подумайте над разными вариантами решения этой задачи.
*/

function comparison (a,b){
    if (a == b){
        return true;
    }else{
        return false;
    }
}
const res = comparison(1,1);
console.log(res);

/* task2
    Написать функцию для получения суммы чисел, которая принимает в себя 2 числа в качестве аргументов, и возвращает их сумму. Необходио написать 2 варианта, как стрелочную, так и обычную функции.
Вызовите ее несколько раз с разными значениями.

*/
function getSum(num1, num2){
    return num1+num2;
}

const result = getSum(5,10);
console.log(result);

let getSum2 = (num1, num2) => num1+num2;

const result2 = getSum2(25, 30);
console.log(result2);

/*task 3
    Напишите функцию для возведения числа в степень
    функция принимает 2 аргумента, число, с которым нужно провести операцию и необходимую степень
    степень является НЕОБЯЗАТЕЛЬНЫМ аргументом, значением по умолчанию является число 2
    функция должна вернуть результат операции

*/

function degree (a, b = 2){
    return Math.pow(a, b);
}

const resultTask3 = degree(6,4);
console.log(resultTask3);

/*task 4
    Реализуйте функцию, которая будеи принимать в себя число от 1 до 7, а возвращать строку, которая будет собой представлять день недели.
    В случае, если число не соответсвует дню недели, верните строку "Такого дня нет"
*/
function recognizingDay(a){
    switch(a){
        case 1:
            return "Понедельник";
            break
        case 2:
            return "Вторник";
            break
        case 3:
            return "Среда";
            break
        case 4:
            return "Четверг";
            break
        case 5:
            return "Пятница";
            break
        case 6:
            return "Суббота";
            break
        case 7:
            return "Воскресенье";
            break
        default:
            return "Нет такого дня,Дебил"
            break
    };
}
const resultTask4 = recognizingDay(8);
console.log(resultTask4);

/*Taks 5
    Написать функцию, которая будет спрашивать у пользователя его имя и возраст, и с помощью alert приветствовать его.
Далее, если возраст больше 30, то показать сообщение с приветсвием Здавствуйте, <Имя Пользователя>
Если меньше, сообщением будет Привет, <Имя Пользователя> (в треугольных скобках должно быть значение имени, введенной пользователем)
*/

const age = prompt("Напишите ваш возраст");
const userName = prompt("Напишите ваше имя");

hello(age, userName);
function hello(age, userName){
    if(age > 30){
        alert(`Здавствуйте,${userName}`);
    }else{
        alert(`Привет,${userName}`);
    }
}

